MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX430F064H.atdf
         <register caption="" name="LATG" offset="0x530" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATG" />
            <bitfield mask="0x00000002" name="LATG" />
            <bitfield mask="0x00000004" name="LATG" />
            <bitfield mask="0x00000008" name="LATG" />
            <bitfield mask="0x00000010" name="LATG" />
            <bitfield mask="0x00000020" name="LATG" />
            <bitfield mask="0x00000040" name="LATG" />
            <bitfield mask="0x00000080" name="LATG" />
            <bitfield mask="0x00000100" name="LATG" />
            <bitfield mask="0x00000200" name="LATG" />
            <bitfield mask="0x00000400" name="LATG" />
            <bitfield mask="0x00000800" name="LATG" />
            <bitfield mask="0x00001000" name="LATG" />
            <bitfield mask="0x00002000" name="LATG" />
            <bitfield mask="0x00004000" name="LATG" />
            <bitfield mask="0x00008000" name="LATG" />
         </register>
         <register caption="" name="ODCB" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCB" />
            <bitfield mask="0x00000002" name="ODCB" />
            <bitfield mask="0x00000004" name="ODCB" />
            <bitfield mask="0x00000008" name="ODCB" />
            <bitfield mask="0x00000010" name="ODCB" />
            <bitfield mask="0x00000020" name="ODCB" />
            <bitfield mask="0x00000040" name="ODCB" />
            <bitfield mask="0x00000080" name="ODCB" />
            <bitfield mask="0x00000100" name="ODCB" />
            <bitfield mask="0x00000200" name="ODCB" />
            <bitfield mask="0x00000400" name="ODCB" />
            <bitfield mask="0x00000800" name="ODCB" />
            <bitfield mask="0x00001000" name="ODCB" />
            <bitfield mask="0x00002000" name="ODCB" />
            <bitfield mask="0x00004000" name="ODCB" />
            <bitfield mask="0x00008000" name="ODCB" />
         </register>
         <register caption="" name="ODCC" offset="0x140" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCC" />
            <bitfield mask="0x00000002" name="ODCC" />
            <bitfield mask="0x00000004" name="ODCC" />
            <bitfield mask="0x00000008" name="ODCC" />
            <bitfield mask="0x00000010" name="ODCC" />
            <bitfield mask="0x00000020" name="ODCC" />
            <bitfield mask="0x00000040" name="ODCC" />
            <bitfield mask="0x00000080" name="ODCC" />
            <bitfield mask="0x00000100" name="ODCC" />
            <bitfield mask="0x00000200" name="ODCC" />
            <bitfield mask="0x00000400" name="ODCC" />
            <bitfield mask="0x00000800" name="ODCC" />
            <bitfield mask="0x00001000" name="ODCC" />
            <bitfield mask="0x00002000" name="ODCC" />
            <bitfield mask="0x00004000" name="ODCC" />
            <bitfield mask="0x00008000" name="ODCC" />
         </register>
         <register caption="" name="ODCD" offset="0x240" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCD" />
            <bitfield mask="0x00000002" name="ODCD" />
            <bitfield mask="0x00000004" name="ODCD" />
            <bitfield mask="0x00000008" name="ODCD" />
            <bitfield mask="0x00000010" name="ODCD" />
            <bitfield mask="0x00000020" name="ODCD" />
            <bitfield mask="0x00000040" name="ODCD" />
            <bitfield mask="0x00000080" name="ODCD" />
            <bitfield mask="0x00000100" name="ODCD" />
            <bitfield mask="0x00000200" name="ODCD" />
            <bitfield mask="0x00000400" name="ODCD" />
            <bitfield mask="0x00000800" name="ODCD" />
            <bitfield mask="0x00001000" name="ODCD" />
            <bitfield mask="0x00002000" name="ODCD" />
            <bitfield mask="0x00004000" name="ODCD" />
            <bitfield mask="0x00008000" name="ODCD" />
         </register>
         <register caption="" name="ODCE" offset="0x340" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCE" />
            <bitfield mask="0x00000002" name="ODCE" />
            <bitfield mask="0x00000004" name="ODCE" />
            <bitfield mask="0x00000008" name="ODCE" />
            <bitfield mask="0x00000010" name="ODCE" />
            <bitfield mask="0x00000020" name="ODCE" />
            <bitfield mask="0x00000040" name="ODCE" />
            <bitfield mask="0x00000080" name="ODCE" />
            <bitfield mask="0x00000100" name="ODCE" />
            <bitfield mask="0x00000200" name="ODCE" />
            <bitfield mask="0x00000400" name="ODCE" />
            <bitfield mask="0x00000800" name="ODCE" />
            <bitfield mask="0x00001000" name="ODCE" />
            <bitfield mask="0x00002000" name="ODCE" />
            <bitfield mask="0x00004000" name="ODCE" />
            <bitfield mask="0x00008000" name="ODCE" />
         </register>
         <register caption="" name="ODCF" offset="0x440" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCF" />
            <bitfield mask="0x00000002" name="ODCF" />
            <bitfield mask="0x00000004" name="ODCF" />
            <bitfield mask="0x00000008" name="ODCF" />
            <bitfield mask="0x00000010" name="ODCF" />
            <bitfield mask="0x00000020" name="ODCF" />
            <bitfield mask="0x00000040" name="ODCF" />
            <bitfield mask="0x00000080" name="ODCF" />
            <bitfield mask="0x00000100" name="ODCF" />
            <bitfield mask="0x00000200" name="ODCF" />
            <bitfield mask="0x00000400" name="ODCF" />
            <bitfield mask="0x00000800" name="ODCF" />
            <bitfield mask="0x00001000" name="ODCF" />
            <bitfield mask="0x00002000" name="ODCF" />
            <bitfield mask="0x00004000" name="ODCF" />
            <bitfield mask="0x00008000" name="ODCF" />
         </register>
         <register caption="" name="ODCG" offset="0x540" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCG" />
            <bitfield mask="0x00000002" name="ODCG" />
            <bitfield mask="0x00000004" name="ODCG" />
            <bitfield mask="0x00000008" name="ODCG" />
            <bitfield mask="0x00000010" name="ODCG" />
            <bitfield mask="0x00000020" name="ODCG" />
            <bitfield mask="0x00000040" name="ODCG" />
            <bitfield mask="0x00000080" name="ODCG" />
            <bitfield mask="0x00000100" name="ODCG" />
            <bitfield mask="0x00000200" name="ODCG" />
            <bitfield mask="0x00000400" name="ODCG" />
            <bitfield mask="0x00000800" name="ODCG" />
            <bitfield mask="0x00001000" name="ODCG" />
            <bitfield mask="0x00002000" name="ODCG" />
            <bitfield mask="0x00004000" name="ODCG" />
            <bitfield mask="0x00008000" name="ODCG" />
         </register>
