MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX430F064H.atdf
         <register caption="Change Notice control for PORTA Register" name="CNCONC" offset="0x170" rw="RW" size="4">
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="CNCONC__SIDL" />
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONC__ON" />
         </register>
         <register caption="Change Notice control for PORTA Register" name="CNCOND" offset="0x270" rw="RW" size="4">
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="CNCOND__SIDL" />
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCOND__ON" />
         </register>
         <register caption="Change Notice control for PORTA Register" name="CNCONE" offset="0x370" rw="RW" size="4">
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="CNCONE__SIDL" />
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONE__ON" />
         </register>
         <register caption="Change Notice control for PORTA Register" name="CNCONF" offset="0x470" rw="RW" size="4">
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="CNCONF__SIDL" />
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONF__ON" />
         </register>
         <register caption="Change Notice control for PORTA Register" name="CNCONG" offset="0x570" rw="RW" size="4">
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="CNCONG__SIDL" />
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONG__ON" />
         </register>
         <register caption="" name="CNENB" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNENB" />
            <bitfield mask="0x00000002" name="CNENB" />
            <bitfield mask="0x00000004" name="CNENB" />
            <bitfield mask="0x00000008" name="CNENB" />
            <bitfield mask="0x00000010" name="CNENB" />
            <bitfield mask="0x00000020" name="CNENB" />
            <bitfield mask="0x00000040" name="CNENB" />
            <bitfield mask="0x00000080" name="CNENB" />
            <bitfield mask="0x00000100" name="CNENB" />
            <bitfield mask="0x00000200" name="CNENB" />
            <bitfield mask="0x00000400" name="CNENB" />
            <bitfield mask="0x00000800" name="CNENB" />
            <bitfield mask="0x00001000" name="CNENB" />
            <bitfield mask="0x00002000" name="CNENB" />
            <bitfield mask="0x00004000" name="CNENB" />
            <bitfield mask="0x00008000" name="CNENB" />
         </register>
         <register caption="" name="CNENC" offset="0x180" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNENC" />
            <bitfield mask="0x00000002" name="CNENC" />
            <bitfield mask="0x00000004" name="CNENC" />
            <bitfield mask="0x00000008" name="CNENC" />
            <bitfield mask="0x00000010" name="CNENC" />
            <bitfield mask="0x00000020" name="CNENC" />
            <bitfield mask="0x00000040" name="CNENC" />
            <bitfield mask="0x00000080" name="CNENC" />
            <bitfield mask="0x00000100" name="CNENC" />
            <bitfield mask="0x00000200" name="CNENC" />
            <bitfield mask="0x00000400" name="CNENC" />
            <bitfield mask="0x00000800" name="CNENC" />
            <bitfield mask="0x00001000" name="CNENC" />
            <bitfield mask="0x00002000" name="CNENC" />
            <bitfield mask="0x00004000" name="CNENC" />
            <bitfield mask="0x00008000" name="CNENC" />
         </register>
         <register caption="" name="CNEND" offset="0x280" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNEND" />
            <bitfield mask="0x00000002" name="CNEND" />
            <bitfield mask="0x00000004" name="CNEND" />
            <bitfield mask="0x00000008" name="CNEND" />
            <bitfield mask="0x00000010" name="CNEND" />
            <bitfield mask="0x00000020" name="CNEND" />
            <bitfield mask="0x00000040" name="CNEND" />
            <bitfield mask="0x00000080" name="CNEND" />
            <bitfield mask="0x00000100" name="CNEND" />
            <bitfield mask="0x00000200" name="CNEND" />
            <bitfield mask="0x00000400" name="CNEND" />
            <bitfield mask="0x00000800" name="CNEND" />
            <bitfield mask="0x00001000" name="CNEND" />
            <bitfield mask="0x00002000" name="CNEND" />
            <bitfield mask="0x00004000" name="CNEND" />
            <bitfield mask="0x00008000" name="CNEND" />
         </register>
         <register caption="" name="CNENE" offset="0x380" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNENE" />
            <bitfield mask="0x00000002" name="CNENE" />
            <bitfield mask="0x00000004" name="CNENE" />
            <bitfield mask="0x00000008" name="CNENE" />
            <bitfield mask="0x00000010" name="CNENE" />
            <bitfield mask="0x00000020" name="CNENE" />
            <bitfield mask="0x00000040" name="CNENE" />
            <bitfield mask="0x00000080" name="CNENE" />
            <bitfield mask="0x00000100" name="CNENE" />
            <bitfield mask="0x00000200" name="CNENE" />
            <bitfield mask="0x00000400" name="CNENE" />
            <bitfield mask="0x00000800" name="CNENE" />
            <bitfield mask="0x00001000" name="CNENE" />
            <bitfield mask="0x00002000" name="CNENE" />
            <bitfield mask="0x00004000" name="CNENE" />
            <bitfield mask="0x00008000" name="CNENE" />
         </register>
         <register caption="" name="CNENF" offset="0x480" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNENF" />
            <bitfield mask="0x00000002" name="CNENF" />
            <bitfield mask="0x00000004" name="CNENF" />
            <bitfield mask="0x00000008" name="CNENF" />
            <bitfield mask="0x00000010" name="CNENF" />
            <bitfield mask="0x00000020" name="CNENF" />
            <bitfield mask="0x00000040" name="CNENF" />
            <bitfield mask="0x00000080" name="CNENF" />
            <bitfield mask="0x00000100" name="CNENF" />
            <bitfield mask="0x00000200" name="CNENF" />
            <bitfield mask="0x00000400" name="CNENF" />
            <bitfield mask="0x00000800" name="CNENF" />
            <bitfield mask="0x00001000" name="CNENF" />
            <bitfield mask="0x00002000" name="CNENF" />
            <bitfield mask="0x00004000" name="CNENF" />
            <bitfield mask="0x00008000" name="CNENF" />
         </register>
         <register caption="" name="CNENG" offset="0x580" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNENG" />
            <bitfield mask="0x00000002" name="CNENG" />
            <bitfield mask="0x00000004" name="CNENG" />
            <bitfield mask="0x00000008" name="CNENG" />
            <bitfield mask="0x00000010" name="CNENG" />
            <bitfield mask="0x00000020" name="CNENG" />
            <bitfield mask="0x00000040" name="CNENG" />
            <bitfield mask="0x00000080" name="CNENG" />
            <bitfield mask="0x00000100" name="CNENG" />
            <bitfield mask="0x00000200" name="CNENG" />
            <bitfield mask="0x00000400" name="CNENG" />
            <bitfield mask="0x00000800" name="CNENG" />
            <bitfield mask="0x00001000" name="CNENG" />
            <bitfield mask="0x00002000" name="CNENG" />
            <bitfield mask="0x00004000" name="CNENG" />
            <bitfield mask="0x00008000" name="CNENG" />
         </register>
