MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX430F064H.atdf
         <register caption="Interrupt Flag Status Register" name="IFS1" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CMP1IF" />
            <bitfield mask="0x00000002" name="CMP2IF" />
            <bitfield mask="0x00000004" name="USBIF" />
            <bitfield mask="0x00000008" name="SPI1EIF" />
            <bitfield mask="0x00000010" name="SPI1RXIF" />
            <bitfield mask="0x00000020" name="SPI1TXIF" />
            <bitfield mask="0x00000040" name="U1EIF" />
            <bitfield mask="0x00000080" name="U1RXIF" />
            <bitfield mask="0x00000100" name="U1TXIF" />
            <bitfield mask="0x00000200" name="I2C1BIF" />
            <bitfield mask="0x00000400" name="I2C1SIF" />
            <bitfield mask="0x00000800" name="I2C1MIF" />
            <bitfield mask="0x00001000" name="CNAIF" />
            <bitfield mask="0x00002000" name="CNBIF" />
            <bitfield mask="0x00004000" name="CNCIF" />
            <bitfield mask="0x00008000" name="CNDIF" />
            <bitfield mask="0x00010000" name="CNEIF" />
            <bitfield mask="0x00020000" name="CNFIF" />
            <bitfield mask="0x00040000" name="CNGIF" />
            <bitfield mask="0x00080000" name="PMPIF" />
            <bitfield mask="0x00100000" name="PMPEIF" />
            <bitfield mask="0x00200000" name="SPI2EIF" />
            <bitfield mask="0x00400000" name="SPI2RXIF" />
            <bitfield mask="0x00800000" name="SPI2TXIF" />
            <bitfield mask="0x01000000" name="U2EIF" />
            <bitfield mask="0x02000000" name="U2RXIF" />
            <bitfield mask="0x04000000" name="U2TXIF" />
            <bitfield mask="0x08000000" name="I2C2BIF" />
            <bitfield mask="0x10000000" name="I2C2SIF" />
            <bitfield mask="0x20000000" name="I2C2MIF" />
            <bitfield mask="0x40000000" name="U3EIF" />
            <bitfield mask="0x80000000" name="U3RXIF" />
         </register>
         <register caption="Interrupt Flag Status Register" name="IFS2" offset="0x50" rw="RW" size="4">
            <bitfield mask="0x00000001" name="U3TXIF" />
            <bitfield mask="0x00000002" name="U4EIF" />
            <bitfield mask="0x00000004" name="U4RXIF" />
            <bitfield mask="0x00000008" name="U4TXIF" />
            <bitfield mask="0x00000010" name="U5EIF" />
            <bitfield mask="0x00000020" name="U5RXIF" />
            <bitfield mask="0x00000040" name="U5TXIF" />
            <bitfield mask="0x00000080" name="CTMUIF" />
            <bitfield mask="0x00000100" name="DMA0IF" />
            <bitfield mask="0x00000200" name="DMA1IF" />
            <bitfield mask="0x00000400" name="DMA2IF" />
            <bitfield mask="0x00000800" name="DMA3IF" />
         </register>
         <register caption="Interrupt Enable Control Register" name="IEC0" offset="0x60" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CTIE" />
            <bitfield mask="0x00000002" name="CS0IE" />
            <bitfield mask="0x00000004" name="CS1IE" />
            <bitfield mask="0x00000008" name="INT0IE" />
            <bitfield mask="0x00000010" name="T1IE" />
            <bitfield mask="0x00000020" name="IC1EIE" />
            <bitfield mask="0x00000040" name="IC1IE" />
            <bitfield mask="0x00000080" name="OC1IE" />
            <bitfield mask="0x00000100" name="INT1IE" />
            <bitfield mask="0x00000200" name="T2IE" />
            <bitfield mask="0x00000400" name="IC2EIE" />
            <bitfield mask="0x00000800" name="IC2IE" />
            <bitfield mask="0x00001000" name="OC2IE" />
            <bitfield mask="0x00002000" name="INT2IE" />
            <bitfield mask="0x00004000" name="T3IE" />
            <bitfield mask="0x00008000" name="IC3EIE" />
            <bitfield mask="0x00010000" name="IC3IE" />
            <bitfield mask="0x00020000" name="OC3IE" />
            <bitfield mask="0x00040000" name="INT3IE" />
            <bitfield mask="0x00080000" name="T4IE" />
            <bitfield mask="0x00100000" name="IC4EIE" />
            <bitfield mask="0x00200000" name="IC4IE" />
            <bitfield mask="0x00400000" name="OC4IE" />
            <bitfield mask="0x00800000" name="INT4IE" />
            <bitfield mask="0x01000000" name="T5IE" />
            <bitfield mask="0x02000000" name="IC5EIE" />
            <bitfield mask="0x04000000" name="IC5IE" />
            <bitfield mask="0x08000000" name="OC5IE" />
            <bitfield mask="0x10000000" name="AD1IE" />
            <bitfield mask="0x20000000" name="FSCMIE" />
            <bitfield mask="0x40000000" name="RTCCIE" />
            <bitfield mask="0x80000000" name="FCEIE" />
         </register>
         <register caption="Interrupt Enable Control Register" name="IEC1" offset="0x70" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CMP1IE" />
            <bitfield mask="0x00000002" name="CMP2IE" />
            <bitfield mask="0x00000004" name="USBIE" />
            <bitfield mask="0x00000008" name="SPI1EIE" />
            <bitfield mask="0x00000010" name="SPI1RXIE" />
            <bitfield mask="0x00000020" name="SPI1TXIE" />
            <bitfield mask="0x00000040" name="U1EIE" />
            <bitfield mask="0x00000080" name="U1RXIE" />
            <bitfield mask="0x00000100" name="U1TXIE" />
            <bitfield mask="0x00000200" name="I2C1BIE" />
            <bitfield mask="0x00000400" name="I2C1SIE" />
            <bitfield mask="0x00000800" name="I2C1MIE" />
            <bitfield mask="0x00001000" name="CNAIE" />
            <bitfield mask="0x00002000" name="CNBIE" />
            <bitfield mask="0x00004000" name="CNCIE" />
            <bitfield mask="0x00008000" name="CNDIE" />
            <bitfield mask="0x00010000" name="CNEIE" />
            <bitfield mask="0x00020000" name="CNFIE" />
            <bitfield mask="0x00040000" name="CNGIE" />
            <bitfield mask="0x00080000" name="PMPIE" />
            <bitfield mask="0x00100000" name="PMPEIE" />
            <bitfield mask="0x00200000" name="SPI2EIE" />
            <bitfield mask="0x00400000" name="SPI2RXIE" />
            <bitfield mask="0x00800000" name="SPI2TXIE" />
            <bitfield mask="0x01000000" name="U2EIE" />
            <bitfield mask="0x02000000" name="U2RXIE" />
            <bitfield mask="0x04000000" name="U2TXIE" />
            <bitfield mask="0x08000000" name="I2C2BIE" />
            <bitfield mask="0x10000000" name="I2C2SIE" />
            <bitfield mask="0x20000000" name="I2C2MIE" />
            <bitfield mask="0x40000000" name="U3EIE" />
            <bitfield mask="0x80000000" name="U3RXIE" />
         </register>
         <register caption="Interrupt Enable Control Register" name="IEC2" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x00000001" name="U3TXIE" />
            <bitfield mask="0x00000002" name="U4EIE" />
            <bitfield mask="0x00000004" name="U4RXIE" />
            <bitfield mask="0x00000008" name="U4TXIE" />
            <bitfield mask="0x00000010" name="U5EIE" />
            <bitfield mask="0x00000020" name="U5RXIE" />
            <bitfield mask="0x00000040" name="U5TXIE" />
            <bitfield mask="0x00000080" name="CTMUIE" />
            <bitfield mask="0x00000100" name="DMA0IE" />
            <bitfield mask="0x00000200" name="DMA1IE" />
            <bitfield mask="0x00000400" name="DMA2IE" />
            <bitfield mask="0x00000800" name="DMA3IE" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC0" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x00000003" name="CTIS" />
            <bitfield mask="0x0000001C" name="CTIP" />
            <bitfield mask="0x00000300" name="CS0IS" />
            <bitfield mask="0x00001C00" name="CS0IP" />
            <bitfield mask="0x00030000" name="CS1IS" />
            <bitfield mask="0x001C0000" name="CS1IP" />
            <bitfield mask="0x03000000" name="INT0IS" />
            <bitfield mask="0x1C000000" name="INT0IP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC1" offset="0xa0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="T1IS" />
            <bitfield mask="0x0000001C" name="T1IP" />
            <bitfield mask="0x00000300" name="IC1IS" />
            <bitfield mask="0x00001C00" name="IC1IP" />
            <bitfield mask="0x00030000" name="OC1IS" />
            <bitfield mask="0x001C0000" name="OC1IP" />
            <bitfield mask="0x03000000" name="INT1IS" />
            <bitfield mask="0x1C000000" name="INT1IP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC2" offset="0xb0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="T2IS" />
            <bitfield mask="0x0000001C" name="T2IP" />
            <bitfield mask="0x00000300" name="IC2IS" />
            <bitfield mask="0x00001C00" name="IC2IP" />
            <bitfield mask="0x00030000" name="OC2IS" />
            <bitfield mask="0x001C0000" name="OC2IP" />
            <bitfield mask="0x03000000" name="INT2IS" />
            <bitfield mask="0x1C000000" name="INT2IP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC3" offset="0xc0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="T3IS" />
            <bitfield mask="0x0000001C" name="T3IP" />
            <bitfield mask="0x00000300" name="IC3IS" />
            <bitfield mask="0x00001C00" name="IC3IP" />
            <bitfield mask="0x00030000" name="OC3IS" />
            <bitfield mask="0x001C0000" name="OC3IP" />
            <bitfield mask="0x03000000" name="INT3IS" />
            <bitfield mask="0x1C000000" name="INT3IP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC4" offset="0xd0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="T4IS" />
            <bitfield mask="0x0000001C" name="T4IP" />
            <bitfield mask="0x00000300" name="IC4IS" />
            <bitfield mask="0x00001C00" name="IC4IP" />
            <bitfield mask="0x00030000" name="OC4IS" />
            <bitfield mask="0x001C0000" name="OC4IP" />
            <bitfield mask="0x03000000" name="INT4IS" />
            <bitfield mask="0x1C000000" name="INT4IP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC5" offset="0xe0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="T5IS" />
            <bitfield mask="0x0000001C" name="T5IP" />
            <bitfield mask="0x00000300" name="IC5IS" />
            <bitfield mask="0x00001C00" name="IC5IP" />
            <bitfield mask="0x00030000" name="OC5IS" />
            <bitfield mask="0x001C0000" name="OC5IP" />
            <bitfield mask="0x03000000" name="AD1IS" />
            <bitfield mask="0x1C000000" name="AD1IP" />
         </register>
